[
  {
    "bookId": 1,
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co.com/WKK6kXc/silent-Patient.png",
    "review": "A masterfully crafted psychological thriller that keeps you on the edge of your seat from beginning to end. The story follows Alicia Berenson, a successful painter who is convicted of murdering her husband and then stops speaking entirely. The novel explores the themes of obsession, trauma, and redemption, with a brilliant twist that leaves readers questioning everything. The writing is tight, and the plot unfolds at a perfect pace, making it impossible to put down. The revelation at the end is truly jaw-dropping, cementing it as one of the best psychological thrillers in recent memory.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological", "Mystery"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "bookId": 2,
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://i.ibb.co.com/BwYSwG6/Educated.png",
    "review": "Tara Westover's memoir is a remarkable and inspiring tale of survival and self-empowerment. Raised in a strict, survivalist family in rural Idaho, Tara is isolated from mainstream society, and education is discouraged. Despite this, she eventually escapes the confines of her upbringing and earns a PhD from the University of Cambridge. This memoir is both heartbreaking and uplifting, as Tara navigates the complexities of family loyalty, personal growth, and the thirst for knowledge. The writing is vivid, emotional, and raw, capturing the tension between the past and the present, and the difficulties of breaking free from one's roots. 'Educated' is a testament to the transformative power of education and a reminder of the importance of questioning the world around us.",
    "totalPages": 352,
    "rating": 4.7,
    "category": "Memoir",
    "tags": ["Autobiography", "Inspiring", "Non-fiction"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 3,
    "bookName": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://i.ibb.co.com/xzBBrSv/Wherethe-Crawdads-Sing.png",
    "review": "Delia Owens' 'Where the Crawdads Sing' is a beautifully written and poignant coming-of-age story set against the backdrop of the North Carolina marshlands. The novel follows Kya Clark, the 'Marsh Girl,' who grows up abandoned by her family and ostracized by the local community. The book explores Kya's deep connection to nature, her fight for survival, and the slow-burning mystery of a murder that takes place in the marsh. The lyrical prose and vivid descriptions of the environment make the setting feel like a character in itself. The novel also touches on themes of loneliness, love, and belonging, and the ending provides a satisfying, yet bittersweet, resolution to the mystery. This is a story that will stay with you long after you’ve turned the last page.",
    "totalPages": 384,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Mystery", "Romance", "Nature"],
    "publisher": "G.P. Putnam's Sons",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 4,
    "bookName": "The Midnight Library",
    "author": "Matt Haig",
    "image": "https://i.ibb.co.com/CJVnQRZ/Matt-Haig-The-midnight-library-flat-lay-book-cover-front.jpg",
    "review": "In 'The Midnight Library,' Matt Haig presents a thought-provoking and emotionally resonant exploration of life’s choices and regrets. The novel centers on Nora Seed, a woman who, after a series of personal crises, finds herself in a magical library where she can explore alternate versions of her life. Each book she opens leads to a different life path, and she is forced to confront the decisions she has made and the possibilities of what could have been. Haig’s writing is full of warmth, humor, and wisdom, offering insights into the nature of happiness, purpose, and the human condition. The novel is a reminder that life is filled with infinite possibilities and that the smallest choices can have profound impacts. 'The Midnight Library' is both an uplifting and introspective read, perfect for anyone who has ever wondered about the road not taken.",
    "totalPages": 304,
    "rating": 4.3,
    "category": "Fantasy",
    "tags": ["Philosophical", "Self-discovery", "Fiction"],
    "publisher": "Viking",
    "yearOfPublishing": 2020
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co.com/MpZbrTF/the-Catcher-In-The-Rye-removebg-preview.png",
    "review": "J.D. Salinger’s 'The Catcher in the Rye' remains a seminal work in American literature, capturing the voice of teenage angst and rebellion with its protagonist, Holden Caulfield. The novel follows Holden as he navigates the alienating and confusing world of adolescence in New York City. His cynical, often disillusioned outlook on life is relatable to anyone who has experienced the turbulence of youth, and Salinger’s portrayal of a young man trying to make sense of the world resonates with readers of all generations. The novel’s themes of isolation, innocence, and the struggle to find meaning are timeless. Despite Holden's alienation and bitterness, there is a vulnerability and sensitivity in his character that makes him deeply sympathetic. This is a book about the painful process of growing up, and it remains as relevant today as it was when it was first published.",
    "totalPages": 277,
    "rating": 4.2,
    "category": "Classic",
    "tags": ["Coming-of-age", "Literary Fiction", "Psychological"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "https://i.ibb.co.com/WH6XY0Y/atomic-Habits-removebg-preview.png",
    "review": "'Atomic Habits' by James Clear is an insightful and practical guide to building better habits and breaking bad ones. Clear delves into the science of habit formation, offering actionable strategies for making small, incremental changes that can lead to lasting personal transformation. What sets this book apart is its emphasis on systems over goals—rather than focusing on achieving a specific result, Clear advocates for creating systems that make success inevitable. Through clear examples and evidence-backed research, he explains how habits work and how you can optimize them to improve your life in every area. Whether you're trying to improve your health, productivity, or relationships, 'Atomic Habits' offers a roadmap for creating sustainable, positive change. This book is a must-read for anyone looking to make meaningful progress in their life, no matter where they’re starting from.",
    "totalPages": 320,
    "rating": 4.7,
    "category": "Self-help",
    "tags": ["Productivity", "Motivation", "Psychology"],
    "publisher": "Avery",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 7,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co.com/8dS7Rnz/the-Great-Gatsby.png",
    "review": "F. Scott Fitzgerald’s 'The Great Gatsby' is one of the most iconic novels of the 20th century, offering a searing critique of the American Dream. The story follows Nick Carraway, who becomes entangled in the lavish and tragic world of Jay Gatsby, a mysterious millionaire who is obsessed with rekindling his lost love for Daisy Buchanan. The novel explores themes of love, obsession, wealth, and the fleeting nature of happiness. Through its richly drawn characters and vivid portrayal of the Jazz Age, Fitzgerald critiques the moral decay beneath the glittering surface of American society. The prose is lyrical and poignant, and the tragic ending remains one of the most unforgettable in literary history. This novel continues to resonate because it speaks to the illusions and disillusionments we all face in our pursuit of success and happiness.",
    "totalPages": 180,
    "rating": 4.4,
    "category": "Classic",
    "tags": ["Literary Fiction", "Tragedy", "Romance"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 8,
    "bookName": "The Book Thief",
    "author": "Markus Zusak",
    "image": "https://i.ibb.co.com/Hn1G30g/the-Book-Thief.png",
    "review": "'The Book Thief' by Markus Zusak is a beautifully written and deeply moving historical novel set in Nazi Germany. Narrated by Death, the story follows Liesel Meminger, a young girl who finds solace in stealing books during the horrors of WWII. The novel explores themes of love, loss, friendship, and the power of words. As Liesel forms deep bonds with her foster parents and friends in a small German town, the backdrop of war intensifies, showing the brutalities of the Nazi regime and its impact on everyday life. Zusak's lyrical prose and unique narrative style create a deeply emotional reading experience. The character of Death, as a narrator, adds a layer of poignancy and reflection on mortality and the human condition. This novel is both heartbreaking and uplifting, offering a powerful reminder of the resilience of the human spirit, even in the darkest of times.",
    "totalPages": 552,
    "rating": 4.9,
    "category": "Historical Fiction",
    "tags": ["WWII", "Historical", "Coming-of-age"],
    "publisher": "Alfred A. Knopf",
    "yearOfPublishing": 2005
  },
  {
    "bookId": 9,
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co.com/SXMSqpy/sapiens-ABrief-History-Of-Humankind-removebg-preview.png",
    "review": "'Sapiens: A Brief History of Humankind' by Yuval Noah Harari is an ambitious and compelling overview of the history of our species, from the emergence of Homo sapiens in Africa to the present day. Harari presents a thought-provoking analysis of how humans have shaped the world through agriculture, empire-building, capitalism, and technology. The book explores how our cognitive revolution allowed us to dominate the planet, how our beliefs and ideologies have shaped civilizations, and the impact we’ve had on the environment and other species. What makes 'Sapiens' so engaging is Harari's ability to synthesize complex ideas and historical events into a readable and stimulating narrative. It challenges conventional views of history and encourages readers to reflect on the future of humanity, as well as our place in the world. This book is a fascinating read for anyone interested in history, anthropology, or philosophy, offering new perspectives on the story of humankind.",
    "totalPages": 443,
    "rating": 4.6,
    "category": "Non-fiction",
    "tags": ["History", "Science", "Philosophy"],
    "publisher": "Harvill Secker",
    "yearOfPublishing": 2011
  },
  {
    "bookId": 10,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.ibb.co.com/SxV0Ttv/the-Hunger-Games.png",
    "review": "'The Hunger Games' by Suzanne Collins is a gripping dystopian novel set in a post-apocalyptic future where the wealthy Capitol forces the impoverished districts to participate in an annual event called the Hunger Games—a deadly competition in which children are pitted against each other in a fight to the death. The story follows Katniss Everdeen, a resourceful and brave young woman who volunteers to take her sister’s place in the games. As she navigates the brutal arena and the complex political landscape, Katniss becomes an unlikely symbol of rebellion. Collins' fast-paced, action-packed writing keeps readers hooked from start to finish, while the novel also explores themes of survival, sacrifice, and the power of media and spectacle. Katniss is a strong and compelling heroine whose journey of self-discovery and resistance to an oppressive regime resonates with readers of all ages. 'The Hunger Games' is a thrilling and thought-provoking novel that sparks conversations about social injustice and the nature of power.",
    "totalPages": 374,
    "rating": 4.6,
    "category": "Dystopian",
    "tags": ["Young Adult", "Adventure", "Sci-Fi"],
    "publisher": "Scholastic Press",
    "yearOfPublishing": 2008
  },
  {
    "bookId": 11,
    "bookName": "Big Little Lies",
    "author": "Liane Moriarty",
    "image": "https://i.ibb.co.com/ScnRSrk/big-Little-Lies.png",
    "review": "'Big Little Lies' by Liane Moriarty is a darkly comic and suspenseful novel that explores the lives of three women, each dealing with her own set of challenges, secrets, and lies. The book is set in an affluent Australian community, where the lives of the women intersect as a school trivia night ends in a shocking death. Moriarty masterfully weaves together themes of motherhood, friendship, marriage, and domestic violence, with a great deal of humor and insight. The narrative is rich in detail, and the characters are complex, multi-dimensional, and deeply human. The novel’s exploration of the small lies people tell to protect themselves and others ultimately leads to bigger, more dangerous consequences. The twists and turns in the story keep readers on edge until the final page. 'Big Little Lies' is a fast-paced, entertaining, and thought-provoking read that delves into the dark side of suburban life.",
    "totalPages": 460,
    "rating": 4.3,
    "category": "Mystery",
    "tags": ["Suspense", "Drama", "Psychological"],
    "publisher": "Flatiron Books",
    "yearOfPublishing": 2014
  },
  {
    "bookId": 12,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co.com/z6J5LD3/the-Alchemist-removebg-preview.png",
    "review": "Paulo Coelho’s 'The Alchemist' is a timeless philosophical novel about following one’s dreams and discovering one's personal legend. The story follows Santiago, a young shepherd, who embarks on a journey across the desert in search of a hidden treasure. Along the way, he meets a series of characters who teach him important lessons about the nature of life, love, and the pursuit of happiness. The novel is rich in symbolism, drawing on themes from alchemy, mysticism, and the quest for self-discovery. Coelho’s writing is poetic and simple, making complex ideas about destiny, intuition, and spiritual fulfillment accessible to readers. 'The Alchemist' is a beautifully inspiring story that reminds readers of the importance of following their dreams and listening to their hearts. It's a book that encourages us all to believe in our own potential and to trust in the journey of life.",
    "totalPages": 208,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Adventure", "Philosophical", "Inspirational"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  }
]
